{
  "slug": "html-basics",
  "title": "Основы HTML",
  "description": "Основные теги и структура HTML документов для создания веб-страниц",
  "difficulty": "beginner",
  "duration": 35,
  "time": 12,
  "theory": "## Структура HTML документа\n\nКаждый HTML документ имеет строго определенную структуру. Декларация DOCTYPE сообщает браузеру версию HTML. Корневой элемент html включает весь документ. В head содержатся метаданные и подключения ресурсов. В body — видимое содержимое страницы. Атрибут lang задает язык документа для поисковых систем и скринридеров.\n\n## Основные теги для текста\n\nЗаголовки h1-h6 формируют иерархию документа: h1 — главный заголовок страницы (один на страницу), h2 — разделы, h3 — подразделы и так далее. Правильная структура заголовков критична для SEO и доступности.\n\nПараграфы p создают текстовые блоки с отступами. Тег strong обозначает важность текста (жирное начертание), em — смысловое ударение (курсив). Тег span — контейнер для стилизации части текста без семантической нагрузки. Перенос строки без нового параграфа делается через br.\n\n## Ссылки и навигация\n\nТег a создает гиперссылки. Атрибут href определяет адрес перехода. target=\"_blank\" открывает ссылку в новой вкладке. Относительные ссылки ведут на страницы внутри сайта, абсолютные — на внешние ресурсы. Якорные ссылки перемещают к элементу с соответствующим id. Ссылки mailto открывают почтовый клиент, tel — инициируют звонок на мобильных устройствах.\n\n## Изображения и медиа\n\nТег img — основной способ вставки изображений. Обязательный атрибут src указывает путь к файлу, alt предоставляет текстовую альтернативу. Это критически важно для доступности и отображается при ошибке загрузки. Атрибуты width и height задают размеры. Для адаптивных изображений используются атрибуты srcset и sizes, позволяющие загружать разные версии картинок под разные разрешения экрана.\n\n```html\n<img src=\"photo.jpg\" alt=\"Описание фотографии\">\n```\n\n## Списки и перечисления\n\nМаркированные списки ul подходят для элементов без порядка. Нумерованные списки ol — для последовательных инструкций. Вложенные списки создают многоуровневые структуры. Атрибут type меняет маркеры или тип нумерации. Списки определений dl содержат термин dt и его описание dd.\n\n## Формы и взаимодействие\n\nФормы form собирают пользовательские данные. Атрибут action указывает URL отправки, method — HTTP метод (GET или POST). Поля ввода input имеют различные типы: text, email, password, number, date, color, range, file. Чекбоксы позволяют множественный выбор, радиокнопки — единственный. Выпадающие списки select с option создают компактное меню выбора. Textarea дает многострочное текстовое поле. Кнопки button отправляют форму или выполняют скрипты.\n\nСовременная валидация форм на стороне клиента включает обязательные поля required, проверку email, минимальную длину minlength, паттерны регулярных выражений pattern. Псевдоклассы :valid и :invalid позволяют стилизовать корректно и некорректно заполненные поля.\n\n## Табличные данные\n\nТаблицы table структурируют связанные данные. Строки tr содержат ячейки. Заголовочные ячейки th отличаются от обычных td семантически и визуально. Объединение ячеек по горизонтали colspan и вертикали rowspan создает сложные таблицы. Заголовки таблиц thead, тело tbody и подвал tfoot улучшают семантику.\n\n## Семантические теги HTML5\n\nСемантическая верстка описывает значение содержимого, а не внешний вид. Header содержит вводную часть или навигацию. Nav — блок навигационных ссылок. Main — уникальное содержимое страницы (один на страницу). Article — самостоятельный, независимый контент. Section — тематическая группировка контента. Aside — косвенно связанный с основным контент. Footer — завершающая часть.\n\nПравильное использование семантических тегов улучшает индексацию поисковиками, навигацию скринридеров и читаемость кода.\n\n## Мета-теги и SEO\n\nМета-теги в head предоставляют браузеру и поисковикам информацию о документе. charset=\"UTF-8\" обеспечивает корректное отображение символов. viewport управляет масштабированием на мобильных устройствах. description задает описание в выдаче поисковиков. keywords исторически использовался для ключевых слов, сейчас маловажен. robots управляет индексацией страницы. author указывает автора. http-equiv эквивалентен HTTP-заголовкам.\n\nOpen Graph теги определяют, как страница выглядит при шеринге в соцсетях: og:title, og:description, og:image, og:url. Favicon подключается через link с rel=\"icon\".\n\n## Мультимедиа и встраивание\n\nВидео video и аудио audio поддерживают множество форматов. Атрибут controls добавляет элементы управления. autoplay запускает автоматически, loop зацикливает, muted отключает звук. Несколько источников source с разными форматами обеспечивают кроссбраузерность. Подписи track добавляют субтитры.\n\nЭлемент iframe встраивает другие HTML-страницы, карты, видео с YouTube. Атрибуты allowfullscreen, loading=\"lazy\" улучшают производительность и функциональность.\n\n## Специальные символы и сущности\n\nHTML-сущности отображают зарезервированные символы: &lt; для знака меньше, &gt; для больше, &amp; для амперсанда, &quot; для кавычек, &copy; для копирайта, &reg; для зарегистрированной торговой марки, &nbsp; для неразрывного пробела. Цифровые коды в формате &#XXXX; представляют любой символ Unicode.\n\n## Доступность и инклюзивность\n\nARIA-атрибуты дополняют семантику: role определяет тип элемента, aria-label предоставляет метку, aria-hidden скрывает элемент от скринридеров. Фокус, контрастность, понятные подписи к формам и alt-тексты делают сайт доступным для всех пользователей.\n\n## Производительность и оптимизация\n\nАсинхронная загрузка скриптов async и defer не блокируют рендеринг. Подключение CSS в head, скриптов перед закрывающим body. Lazy loading изображений и iframe. Минификация кода. Использование современных форматов изображений WebP, AVIF.\n\n## Валидация и отладка\n\nВалидатор W3C проверяет синтаксическую корректность. Инструменты разработчика в браузере показывают DOM-дерево, стили, сетевые запросы. Консоль выводит ошибки и предупреждения. Lighthouse оценивает производительность, доступность, SEO.\n\n## Лучшие практики\n\n1. Всегда закрывайте теги, кроме одиночных (img, br, input)\n2. Используйте семантические теги по назначению\n3. Добавляйте alt ко всем изображениям\n4. Соблюдайте иерархию заголовков\n5. Валидируйте HTML код\n6. Обеспечьте адаптивность метатегом viewport\n7. Комментируйте сложные участки кода\n8. Разделяйте структуру, стили и поведение\n9. Используйте осмысленные имена классов и id\n10. Проверяйте доступность\n\n## Распространенные ошибки\n\n❌ Пропуск DOCTYPE — вызывает quirks режим\n❌ Неправильная вложенность — блоки внутри инлайн-элементов\n❌ Отсутствие alt у изображений — проблема доступности\n❌ Пустые атрибуты — лучше удалить полностью\n❌ Избыточная вложенность — усложняет код\n❌ Использование устаревших тегов — font, center, big\n❌ Копирование стилей атрибутом style — лучше внешние стили\n❌ Неправильные типы input — неудобство для пользователей\n\n## Инструменты и ресурсы\n\nРедакторы кода с подсветкой синтаксиса и Emmet. Онлайн-песочницы для быстрого тестирования. Документация MDN — авторитетный источник. Готовые normalize.css для кроссбраузерности.\n\n## Заключение\n\nHTML — фундамент веб-разработки. Освоение основ требует понимания структуры документа, семантики тегов, правил вложенности и современных стандартов. Постоянная практика, изучение кода существующих сайтов, работа с документацией и инструментами разработчика помогут перейти от простых страниц к сложным веб-приложениям. Следите за обновлениями спецификации HTML, экспериментируйте с новыми возможностями и всегда думайте о пользователях с ограниченными возможностями.",
  
  "points": [
    "Структура HTML документа и DOCTYPE",
    "Заголовки и иерархия контента",
    "Работа с текстом: параграфы, выделения, переносы",
    "Гиперссылки и навигация",
    "Изображения и адаптивная графика",
    "Списки различных типов",
    "Формы, типы полей и валидация",
    "Таблицы и объединение ячеек",
    "Семантическая верстка HTML5",
    "Мета-теги и Open Graph",
    "Мультимедиа: аудио, видео, iframe",
    "Спецсимволы и HTML-сущности",
    "Доступность и ARIA-атрибуты",
    "Производительность загрузки",
    "Валидация и отладка",
    "Лучшие практики и частые ошибки"
  ],
  
  "lesson": {
    "slug": "html-forms",
    "title": "HTML Формы и Валидация"
  }
}