{
  "slug": "html-accessibility",
  "title": "Доступность в HTML (Accessibility)",
  "description": "Полное руководство по созданию доступных веб-страниц с использованием семантического HTML, ARIA, клавиатурной навигации и лучших практик для пользователей с ограниченными возможностями",
  "difficulty": "intermediate",
  "duration": 55,
  "time":8,
  
  "theory": "Доступность в HTML: Полное Руководство\n\n### Введение в Веб-Доступность\n\nВеб-доступность (Web Accessibility, a11y) — это практика создания веб-сайтов, которые могут использовать все люди, независимо от их физических или когнитивных способностей. Доступность — это не просто соблюдение стандартов, это забота о миллионах пользователей с различными ограничениями: слепые и слабовидящие, глухие и слабослышащие, люди с моторными нарушениями, люди с когнитивными особенностями, временные ограничения (травма руки, яркое солнце на экране), пожилые пользователи. Доступный веб приносит пользу всем: улучшает UX для всех пользователей, повышает SEO, расширяет аудиторию, соответствует законодательству во многих странах, демонстрирует социальную ответственность.\n\n### WCAG — Руководство по Доступности\n\n**Web Content Accessibility Guidelines:** WCAG — международный стандарт веб-доступности от W3C. Текущая версия — WCAG 2.1 (2018), новая версия WCAG 2.2 (2023). Три уровня соответствия: A (базовый), AA (рекомендуемый, требуется законодательством), AAA (расширенный).\n\n**Четыре Принципа POUR:**\n\n**Perceivable (Воспринимаемость):** Информация должна быть представлена так, чтобы пользователи могли ее воспринять. Альтернативы для нетекстового контента. Адаптируемый контент. Различимый контент (цвет, контраст, размер).\n\n**Operable (Управляемость):** Все функции доступны с клавиатуры. Достаточно времени для чтения и использования. Отсутствие контента, вызывающего приступы. Помощь в навигации и поиске.\n\n**Understandable (Понятность):** Текст читаемый и понятный. Предсказуемое поведение. Помощь в избежании и исправлении ошибок.\n\n**Robust (Надежность):** Совместимость с вспомогательными технологиями. Валидный, семантический код. Прогрессивное улучшение.\n\n### Семантический HTML как Основа Доступности\n\n**Важность Семантики:** Правильные HTML элементы передают смысл контента. Вспомогательные технологии опираются на семантику. Браузеры предоставляют встроенную доступность семантических элементов.\n\n**Ключевые Семантические Элементы:**\n- **header** — шапка страницы или секции, скринридеры идентифицируют как landmark\n- **nav** — навигационная область, позволяет быстро переходить к навигации\n- **main** — основное содержимое, должен быть единственным, прямой переход к контенту\n- **article** — независимый контент, скринридеры объявляют границы\n- **section** — тематическая группа контента, должна иметь заголовок\n- **aside** — дополнительный контент, скринридеры могут пропустить\n- **footer** — подвал страницы или секции, завершающий landmark\n\n**Заголовки H1-H6:** Создают иерархическую структуру документа. Скринридеры используют для навигации. Один H1 на странице. Не пропускать уровни. Заголовки должны отражать структуру, не стиль.\n\n**Избегайте Div-ита:** Div и span не несут семантического значения. Используйте их только когда нет семантической альтернативы. Каждый div должен иметь обоснование.\n\n### ARIA — Accessible Rich Internet Applications\n\n**Что такое ARIA:** ARIA — набор атрибутов для улучшения доступности веб-приложений. Дополняет HTML семантикой. Особенно важен для динамических интерфейсов. ARIA описывает роли, состояния и свойства элементов.\n\n**Первое Правило ARIA:** Не используйте ARIA, если можете использовать нативный HTML элемент. Нативные элементы имеют встроенную доступность. ARIA не добавляет функциональность, только описывает. Неправильный ARIA хуже, чем его отсутствие.\n\n**Роли (Roles):** Определяют тип элемента для вспомогательных технологий.\n\n**Landmark Роли:**\n- **role=\"banner\"** — шапка (нативно: header в body)\n- **role=\"navigation\"** — навигация (нативно: nav)\n- **role=\"main\"** — основной контент (нативно: main)\n- **role=\"complementary\"** — дополнительный контент (нативно: aside)\n- **role=\"contentinfo\"** — информация о контенте (нативно: footer в body)\n- **role=\"search\"** — поиск (нет нативного эквивалента)\n- **role=\"form\"** — форма (нативно: form с accessible name)\n- **role=\"region\"** — значимая область (нативно: section с accessible name)\n\n**Widget Роли:**\n- **role=\"button\"** — кнопка (нативно: button)\n- **role=\"checkbox\"** — чекбокс (нативно: input type=\"checkbox\")\n- **role=\"tab\"** — вкладка\n- **role=\"tabpanel\"** — панель вкладки\n- **role=\"dialog\"** — диалоговое окно (частично: dialog)\n- **role=\"alertdialog\"** — диалог с предупреждением\n- **role=\"menu\"** — меню\n- **role=\"menuitem\"** — элемент меню\n- **role=\"tooltip\"** — всплывающая подсказка\n\n**Document Structure Роли:**\n- **role=\"article\"** — статья (нативно: article)\n- **role=\"list\"** — список (нативно: ul, ol)\n- **role=\"listitem\"** — элемент списка (нативно: li)\n- **role=\"table\"** — таблица (нативно: table)\n- **role=\"row\"** — строка (нативно: tr)\n- **role=\"cell\"** — ячейка (нативно: td)\n\n**Состояния и Свойства (States and Properties):**\n\n**aria-label:** Текстовая метка для элемента. Переопределяет видимый текст. Используйте когда видимого label нет. Скринридеры озвучивают вместо содержимого.\n\n**aria-labelledby:** Ссылается на элемент(ы), содержащие метку. Значение — ID элемента. Может ссылаться на несколько ID через пробел. Предпочтительнее aria-label когда метка видима.\n\n**aria-describedby:** Ссылается на дополнительное описание. Используется для подсказок, ошибок, инструкций. Озвучивается после основной метки.\n\n**aria-hidden:** Скрывает элемент от вспомогательных технологий. aria-hidden=\"true\" — элемент игнорируется. Используйте для декоративных элементов. Не скрывайте фокусируемые элементы.\n\n**aria-live:** Объявляет динамические изменения. aria-live=\"polite\" — объявить когда удобно. aria-live=\"assertive\" — объявить немедленно. aria-live=\"off\" — не объявлять (по умолчанию). Используется для уведомлений, чатов, обновлений.\n\n**aria-expanded:** Состояние раскрытия/сворачивания. aria-expanded=\"true\" — развернуто. aria-expanded=\"false\" — свернуто. Используется для аккордеонов, выпадающих меню.\n\n**aria-selected:** Элемент выбран. Используется для вкладок, списков. aria-selected=\"true\" или \"false\".\n\n**aria-checked:** Состояние чекбокса или радио. aria-checked=\"true\", \"false\", \"mixed\".\n\n**aria-disabled:** Элемент неактивен. aria-disabled=\"true\" — неактивен но видим. Отличается от disabled — disabled удаляет из tab order.\n\n**aria-invalid:** Поле содержит ошибку. aria-invalid=\"true\" при ошибке валидации. Комбинируйте с aria-describedby для описания ошибки.\n\n**aria-required:** Обязательное поле. aria-required=\"true\". Дублируйте визуально (звездочка, текст).\n\n**aria-current:** Текущий элемент в наборе. aria-current=\"page\" — текущая страница. aria-current=\"step\" — текущий шаг. aria-current=\"location\" — текущая локация. Используется в навигации, breadcrumbs, пагинации.\n\n### Клавиатурная Доступность\n\n**Почему Важна:** Многие пользователи полагаются только на клавиатуру. Скринридеры используют клавиатурную навигацию. Моторные нарушения могут препятствовать использованию мыши. Временные ситуации (сломанная мышь, работа без мыши).\n\n**Базовые Требования:** Все интерактивные элементы доступны через Tab. Видимый индикатор фокуса. Логический порядок табуляции. Возможность активации через Enter или Пробел. Возможность закрыть модальные окна через Escape.\n\n**Tab Order и Tabindex:**\n\n**tabindex=\"0\"** — элемент в естественном tab order, делает нефокусируемые элементы фокусируемыми, используйте осторожно.\n\n**tabindex=\"-1\"** — элемент программно фокусируемый, но не в tab order, используется для управления фокусом через JavaScript, полезно для модальных окон, skip links.\n\n**tabindex=\"1+\"** — НЕ ИСПОЛЬЗУЙТЕ, нарушает естественный порядок, создает путаницу, антипаттерн.\n\n**Нативно Фокусируемые Элементы:** a (с href), button, input, select, textarea, audio/video (с controls). Не добавляйте tabindex к этим элементам без причины.\n\n**Управление Фокусом:** Перемещение фокуса при открытии модального окна. Возврат фокуса после закрытия. Ловушка фокуса внутри модального окна. Фокус на первый элемент формы после ошибки.\n\n**Индикатор Фокуса:** Никогда не удаляйте outline полностью. Если удаляете, предоставьте альтернативный индикатор. Используйте :focus-visible для стилизации только клавиатурного фокуса. Обеспечьте контраст минимум 3:1 с фоном.\n\n**Клавиатурные Паттерны:**\n\n**Модальные Окна:** Tab циклически внутри модального окна. Escape закрывает модальное окно. Фокус на первый элемент при открытии. Возврат фокуса после закрытия.\n\n**Выпадающие Меню:** Enter/Пробел открывает меню. Стрелки для навигации внутри. Escape закрывает меню. Tab выходит из меню.\n\n**Вкладки (Tabs):** Стрелки для переключения между вкладками. Home/End для первой/последней вкладки. Tab переходит к содержимому активной вкладки. Автоматическая или ручная активация.\n\n**Аккордеоны:** Enter/Пробел разворачивает/сворачивает. Стрелки для навигации между заголовками.\n\n**Комбобоксы:** Стрелки для выбора опций. Enter для подтверждения. Escape для закрытия. Поиск по первым буквам.\n\n### Формы и Доступность\n\n**Label для Каждого Поля:** Каждый input должен иметь связанный label. Используйте атрибут for или вложенность. Label увеличивает область клика. Скринридеры озвучивают label.\n\n**Группировка через Fieldset:** Используйте fieldset для группы связанных полей. Legend описывает группу. Особенно важно для радиокнопок и чекбоксов. Скринридеры озвучивают legend перед каждым полем в группе.\n\n**Инструкции и Подсказки:** Общие инструкции перед формой. Инструкции для полей через aria-describedby. Примеры формата ввода. Объяснение обязательных полей.\n\n**Индикация Обязательных Полей:** Визуальная индикация (звездочка, текст). Атрибут required для HTML5 валидации. aria-required=\"true\" для скринридеров. Объяснение в начале формы.\n\n**Сообщения об Ошибках:** Четкие, конкретные сообщения. Размещение рядом с полем. Связь через aria-describedby. aria-invalid=\"true\" на поле с ошибкой. Объявление через aria-live при AJAX валидации. Фокус на первое поле с ошибкой.\n\n**Автозаполнение:** Атрибут autocomplete с правильными токенами. Упрощает заполнение форм. Особенно важно для людей с когнитивными нарушениями. Токены: name, email, tel, street-address и др.\n\n### Доступность Цвета и Контраста\n\n**Контрастность:** Достаточный контраст критичен для слабовидящих. WCAG требования: обычный текст (< 24px) — минимум 4.5:1 (AA), 7:1 (AAA), крупный текст (≥ 24px или ≥ 19px bold) — минимум 3:1 (AA), 4.5:1 (AAA), UI компоненты и графика — минимум 3:1.\n\n**Инструменты Проверки:** WebAIM Contrast Checker. Chrome DevTools (Lighthouse, встроенная проверка). Contrast Ratio от Lea Verou. Stark plugin для дизайна.\n\n**Цвет Не Единственный Индикатор:** Не полагайтесь только на цвет для передачи информации. Дальтоники не различают некоторые цвета. Дублируйте цветовую информацию: текстом, иконками, паттернами, формой.\n\n**Примеры:** Ссылки — не только синий цвет, но и подчеркивание. Графики — не только цвета, но и символы/паттерны. Ошибки — не только красный цвет, но и иконка/текст. Статусы — не только цвета, но и текстовые метки.\n\n### Альтернативный Текст для Изображений\n\n**Атрибут Alt:** Обязателен для всех img элементов. Описывает содержимое изображения. Озвучивается скринридерами. Отображается при ошибке загрузки. Используется поисковыми системами.\n\n**Как Писать Хороший Alt:**\n\n**Информативные Изображения:** Краткое описание содержимого. Передавайте суть, не детали. Без слов \"изображение\" или \"картинка\". Контекст важен.\n\n**Декоративные Изображения:** Используйте пустой alt=\"\". Скринридеры пропустят. Применяется для: фоновых паттернов, разделителей, чисто декоративных элементов.\n\n**Функциональные Изображения:** Описывайте функцию, не внешний вид. Для кнопок-изображений: что произойдет при клике. Для логотипов-ссылок: куда ведет ссылка.\n\n**Сложные Изображения:** Краткий alt плюс расширенное описание. Используйте aria-describedby для подробностей. Для графиков, диаграмм — текстовая таблица данных. Для инфографики — развернутое текстовое описание.\n\n**Изображения с Текстом:** Текст на изображении должен быть в alt. Лучше избегать текста на изображениях. Если необходимо — дублируйте текстом рядом.\n\n### Мультимедиа и Доступность\n\n**Субтитры для Видео:** Обязательны для глухих пользователей. Включают диалоги и важные звуки. Формат WebVTT через элемент track. Captions vs Subtitles: captions — для глухих, включают звуковые эффекты, subtitles — перевод на другой язык.\n\n**Транскрипты:** Текстовая версия аудио/видео контента. Доступны для всех пользователей. Помогают поиску и индексации. Полезны в шумной обстановке. Должны включать: все диалоги, описание важных визуальных элементов, описание звуков.\n\n**Аудио Описания:** Дополнительная звуковая дорожка. Описывает визуальные элементы. Для слепых пользователей. Вставляется в паузы диалога. Через отдельный track или отдельное видео.\n\n**Элементы Управления:** Доступны с клавиатуры. Достаточно крупные (минимум 44x44px). Четкие метки. Видимый фокус.\n\n### Структура и Навигация\n\n**Skip Links:** Ссылка в начале страницы для пропуска навигации. Переход сразу к основному контенту. Может быть визуально скрыта до фокуса. Критична для клавиатурных пользователей. Обычно первый элемент в body.\n\n**Landmarks:** Структурные области страницы. Позволяют быстро переходить между секциями. Скринридеры предоставляют список landmarks. Используйте семантические HTML5 элементы или ARIA роли. Каждый landmark должен иметь уникальную метку если их несколько одного типа.\n\n**Breadcrumbs:** Показывают местоположение в иерархии. Используйте nav с aria-label=\"breadcrumb\". Список с правильной разметкой. aria-current=\"page\" на текущей странице.\n\n**Пагинация:** Четкие метки для навигации. aria-label на nav контейнере. aria-current=\"page\" на текущей странице. Достаточный размер кликабельной области.\n\n**Поиск:** Используйте role=\"search\" на форме поиска. Четкая метка для поля ввода. Кнопка отправки с понятным текстом.\n\n### Таблицы и Доступность\n\n**Семантическая Структура:** Используйте table для табличных данных. thead, tbody, tfoot для структуры. th для заголовков. caption для описания таблицы.\n\n**Scope Атрибут:** scope=\"col\" на заголовках столбцов. scope=\"row\" на заголовках строк. Связывает данные с заголовками. Критично для скринридеров.\n\n**Headers и ID:** Для сложных таблиц. Явная связь между ячейками и заголовками. headers=\"id1 id2\" на ячейке. Несколько ID через пробел.\n\n**Не Для Разметки:** Таблицы только для табличных данных. НЕ для верстки страницы. Используйте CSS Grid/Flexbox.\n\n### Динамический Контент\n\n**ARIA Live Regions:** Объявление динамических изменений. aria-live=\"polite\" — объявить когда пользователь не занят. aria-live=\"assertive\" — объявить немедленно. aria-live=\"off\" — не объявлять.\n\n**aria-atomic:** aria-atomic=\"true\" — озвучить весь регион при изменении. aria-atomic=\"false\" — озвучить только изменения (по умолчанию).\n\n**aria-relevant:** Какие изменения объявлять. additions — добавления. removals — удаления. text — изменения текста. all — все изменения. По умолчанию: \"additions text\".\n\n**Роли Live Regions:**\n- **role=\"status\"** — статусные сообщения (polite, atomic)\n- **role=\"alert\"** — важные сообщения (assertive, atomic)\n- **role=\"log\"** — логи, чаты (polite, новые добавления)\n- **role=\"timer\"** — таймер, часы\n- **role=\"marquee\"** — динамический, несущественный контент\n\n**Примеры Использования:** Уведомления о сохранении. Ошибки валидации формы. Сообщения чата. Обновления количества товаров в корзине. Прогресс загрузки.\n\n### Модальные Окна и Диалоги\n\n**Требования к Доступности:** Фокус перемещается в модальное окно при открытии. Фокус возвращается на триггер при закрытии. Ловушка фокуса — Tab циклически внутри. Escape закрывает окно. Подложка не фокусируема и блокирует клики. Объявление скринридерами.\n\n**Элемент Dialog:** HTML5 элемент dialog. Метод showModal() для модальных окон. Автоматическая ловушка фокуса. ::backdrop для подложки. Нативная поддержка Escape.\n\n**ARIA для Диалогов:**\n- **role=\"dialog\"** или role=\"alertdialog\"\n- **aria-modal=\"true\"** — указывает модальность\n- **aria-labelledby** — ссылка на заголовок\n- **aria-describedby** — ссылка на описание\n\n**Управление Фокусом:** JavaScript для ловушки фокуса. Сохранение ссылки на триггер. Фокус на первый интерактивный элемент или заголовок. Восстановление фокуса при закрытии.\n\n### Вспомогательные Технологии\n\n**Скринридеры:** Программы, озвучивающие содержимое экрана. Популярные: NVDA (Windows, бесплатный), JAWS (Windows, платный), VoiceOver (macOS, iOS, встроенный), TalkBack (Android, встроенный), Orca (Linux). Используют accessibility tree браузера. Полагаются на семантику и ARIA.\n\n**Лупы Экрана:** Увеличивают часть экрана. ZoomText, Windows Magnifier, macOS Zoom. Требуют адаптивного дизайна. Важен текст вместо изображений текста.\n\n**Голосовое Управление:** Dragon NaturallySpeaking, Voice Control (macOS/iOS). Полагаются на видимые метки. Важны accessible names.\n\n**Переключатели:** Для людей с серьезными моторными нарушениями. Одна или две кнопки для навигации. Требуют упрощенной клавиатурной навигации.\n\n### Тестирование Доступности\n\n**Автоматические Инструменты:** Находят 20-30% проблем. axe DevTools — расширение браузера. WAVE — веб-инструмент и расширение. Lighthouse — встроен в Chrome DevTools. pa11y — автоматизация через командную строку. Jest-axe — тестирование в юнит-тестах.\n\n**Ручное Тестирование:**\n\n**Клавиатурная Навигация:** Пройдите весь сайт только клавиатурой. Tab для навигации. Enter/Пробел для активации. Escape для закрытия. Проверьте видимость фокуса.\n\n**Скринридеры:** Тестируйте с реальными скринридерами. NVDA или VoiceOver — бесплатные. Проверьте объявления всех элементов. Навигация по заголовкам, landmarks, формам.\n\n**Контраст:** Проверьте все комбинации текста и фона. Используйте инструменты проверки контраста. Включая состояния hover, focus, active.\n\n**Масштабирование:** Увеличьте масштаб до 200%. Проверьте отсутствие горизонтальной прокрутки. Весь контент остается доступным. Без наложения элементов.\n\n**Чек-лист Доступности:** Все изображения имеют alt. Формы имеют label. Заголовки образуют логическую иерархию. Контраст соответствует 4.5:1. Все функции доступны с клавиатуры. Видимый индикатор фокуса. Видео имеют субтитры. HTML валиден. Нет ошибок ARIA. Landmarks правильно размечены.\n\n### Общие Антипаттерны\n\n**Проблемы:**\n- Div-кнопки без клавиатурной доступности\n- Placeholder вместо label\n- Недостаточный контраст\n- Удаление outline без альтернативы\n- Автовоспроизведение видео/аудио\n- Контент, зависящий только от цвета\n- Отсутствие alt у изображений\n- Положительный tabindex (1+)\n- Модальные окна без ловушки фокуса\n- ARIA на элементах без необходимости\n\n**Решения:**\n- Используйте button элемент\n- Label + placeholder вместе\n- Проверяйте и корректируйте контраст\n- Стилизуйте :focus или :focus-visible\n- Только muted autoplay с контролами\n- Дублируйте информацию текстом/иконками\n- Добавляйте описательный alt\n- Используйте только 0 или -1\n- Реализуйте правильное управление фокусом\n- Используйте нативные элементы когда возможно\n\n### Прогрессивное Улучшение и Доступность\n\n**Базовый HTML Первым:** Начинайте с семантического HTML. Обеспечивает базовую доступность. Работает без CSS и JavaScript. Прогрессивно улучшайте.\n\n**JavaScript Enhancement:** JavaScript должен улучшать, а не требоваться. Контент доступен без JavaScript. Функциональность деградирует gracefully. noscript для критичных случаев.\n\n**CSS и Доступность:** Не скрывайте контент, нужный скринридерам. Визуально скрытый, но доступный для AT. Не используйте display: none или visibility: hidden для важного контента.\n\n### Доступность и Законодательство\n\n**Международные Стандарты:** WCAG 2.1 — международный стандарт. EN 301 549 — европейский стандарт. Section 508 — США (государственные сайты). ADA — США (Закон об американцах с инвалидностью). EAA — Европейский акт о доступности.\n\n**Юридические Требования:** Многие страны требуют соответствие WCAG AA. Штрафы за несоответствие. Иски от пользователей. Государственные и образовательные сайты — строгие требования. Коммерческие сайты — растущие требования.\n\n### Лучшие Практики\n\n1. Используйте семантический HTML.\n2. Обеспечивайте клавиатурную доступность.\n3. Добавляйте alt ко всем изображениям.\n4. Используйте достаточный контраст (4.5:1).\n5. Обеспечивайте видимый индикатор фокуса.\n6. Label для каждого поля формы.\n7. Используйте ARIA только когда необходимо.\n8. Тестируйте со скринридерами.\n9. Создавайте логическую иерархию заголовков.\n10. Не полагайтесь только на цвет.\n11. Предоставляйте субтитры к видео.\n12. Управляйте фокусом в динамических интерфейсах.\n13. Используйте live regions для объявлений.\n14. Валидируйте HTML.\n15. Регулярно проводите аудит доступности.\n\n### Заключение\n\nДоступность — не дополнительная функция, а фундаментальное требование качественного веба. Каждый заслуживает равного доступа к информации и услугам в интернете. Создание доступных сайтов начинается с правильного семантического HTML, дополняется ARIA где необходимо, обеспечивается клавиатурной навигацией и тестируется с реальными пользователями и вспомогательными технологиями. Доступность — это непрерывный процесс, требующий внимания на всех этапах разработки. Инвестиции в доступность окупаются расширением аудитории, улучшением UX для всех, соответствием законодательству и демонстрацией социальной ответственности. Делайте веб доступным для всех.",
  
  "points": [
    "WCAG стандарты и принципы POUR",
    "Семантический HTML как основа доступности",
    "Иерархия заголовков H1-H6",
    "ARIA роли: landmarks, widgets, document structure",
    "ARIA состояния и свойства: label, labelledby, describedby, hidden",
    "aria-live для динамического контента",
    "Клавиатурная доступность и tab order",
    "Управление фокусом в динамических интерфейсах",
    "Tabindex: правильное использование 0 и -1",
    "Индикатор фокуса и :focus-visible",
    "Клавиатурные паттерны для виджетов",
    "Доступность форм: label, fieldset, ошибки",
    "Цветовой контраст и WCAG требования",
    "Альтернативный текст для изображений",
    "Субтитры и транскрипты для мультимедиа",
    "Skip links и навигационные landmarks",
    "Доступность таблиц: scope, headers",
    "ARIA live regions для объявлений",
    "Модальные окна: ловушка фокуса, роли",
    "Вспомогательные технологии: скринридеры, лупы",
    "Тестирование: автоматические инструменты и ручное",
    "Общие антипаттерны и их решения",
    "Прогрессивное улучшение и доступность",
    "Законодательство и юридические требования"
  ],
  
  "lesson": {
    "slug": "html-seo",
    "title": "SEO и мета-теги в HTML"
  }
}